
# Space Launches

## Data Description

Dataset containing all space missions from 1957 to August 2022. The dataset contains the following fields:

| Field          | Description                                               |
|----------------|-----------------------------------------------------------|
| Company        | Company responsible for the space mission                 |
| Location       | Location of the launch                                    |
| Date           | Date of the launch                                        |
| Time           | Time of the launch (UTC)                                  |
| Rocket         | Name of the rocket used for the mission                   |
| Mission        | Name of the space mission (or missions)                   |
| RocketStatus   | Status of the rocket as of August 2022 (Active or Inactive)|
| Price          | Cost of the rocket in millions of US dollars              |
| MissionStatus  | Status of the mission (Success, Failure, Partial Failure, Prelaunch Failure) |

## Database structure

The database has the following nodes:
- `Company` nodes with the `name` property
- `Mission` nodes with the `name` and `status` properties
- `Rocket` nodes with the `name`, `status` and `price` properties

The database has the following relationships:
- `STARTS` relationships from `Company` to `Mission` nodes
- `LAUNCHES` relationships from `Mission` to `Rocket` nodes with the `date`, `time`, and `location` 


## 0. Load the data from the file `/resources/space_launches.csv`.

```java
session.run("LOAD CSV WITH HEADERS FROM 'file:///resources/space_launches.csv' AS row " +
            "MERGE (c:Company {name: row.Company}) " +
            "MERGE (m:Mission {name: row.Mission, status: row.MissionStatus}) " +
            "MERGE (rocket:Rocket {name: row.Rocket, status: row.RocketStatus, price: coalesce(toFloat(row.Price), 0)}) " +
            "MERGE (c)-[r:STARTS]->(m) " +
            "MERGE (m)-[l:LAUNCHES {date: row.Date, time: coalesce(row.Time, '00:00:00'), location: row.Location}]->(rocket)");
```

## Queries

```java
// 1. List all companies that have launched a mission
System.out.println("\n1. Companies that have launched a mission: ");
result = session.run("MATCH (c:Company)-[r:STARTS]->(m:Mission) " +
                        "RETURN distinct c.name");
result.list().stream().limit(5).forEach(record -> System.out.println(record.values().get(0)));
System.out.println("...");

// 2. Rockets with more than 50 launches
System.out.println("\n2. Rockets more than 50 launches: ");
result = session.run("MATCH ()-[l:LAUNCHES]->(rocket:Rocket)" +
                        "WITH rocket, count(l) as launches " +
                        "WHERE launches > 50 " +
                        "RETURN rocket.name");
result.list().stream().limit(5).forEach(record -> System.out.println(record.values().get(0)));
System.out.println("...");

// 3. Rocket more expensive (order by price)
System.out.println("\n3. Rocket more expensive: ");
result = session.run("MATCH (rocket:Rocket) " +
                        "RETURN rocket.name, rocket.price " +
                        "ORDER BY rocket.price DESC");
result.list().stream().limit(5).forEach(record -> System.out.println(record.values().get(0) + " - " + record.values().get(1)));
System.out.println("...");

// 4. Number of launches per company (order by number of launches)
System.out.println("\n4. Number of launches per company: ");
result = session.run("MATCH (c:Company)-[r:STARTS]->(m:Mission)-[l:LAUNCHES]->(rocket:Rocket) " +
                        "RETURN c.name, count(l) as launches " +
                        "ORDER BY launches DESC");
result.list().stream().limit(5).forEach(record -> System.out.println(record.values().get(0) + " - " + record.values().get(1)));
System.out.println("...");

// 5. Company with more missions failed (order by number of missions failed)
System.out.println("\n5. Company with more missions failed: ");
result = session.run("MATCH (c:Company)-[r:STARTS]->(m:Mission {status: 'Failure'}) " +
                        "RETURN c.name, count(m) as failedMissions " +
                        "ORDER BY failedMissions DESC");
result.list().stream().limit(5).forEach(record -> System.out.println(record.values().get(0) + " - " + record.values().get(1)));
System.out.println("...");

// 6. Most common location for launches (order by number of launches)
System.out.println("\n6. Most common location for launches: ");
result = session.run("MATCH ()-[l:LAUNCHES]->(rocket:Rocket) " +
                        "RETURN l.location, count(l) as launches " +
                        "ORDER BY launches DESC");
result.list().stream().limit(5).forEach(record -> System.out.println(record.values().get(0) + " - " + record.values().get(1)));
System.out.println("...");

// 7. Distance between US Air Force and NASA (distance is the shortest path between nodes in the graph)
System.out.println("\n7. Distance between US Air Force and NASA: ");
result = session.run("MATCH (nasa:Company {name: 'US Air Force'}), (spacex:Company {name: 'NASA'}), p = shortestPath((nasa)-[*]-(spacex)) " +
                        "RETURN length(p) as distance");
result.list().forEach(record -> System.out.println(record.values().get(0)));

// 8. Number of missions launched by year in SpaceX vs NASA
System.out.println("\n8. Number of missions launched by year in SpaceX vs NASA: ");
result = session.run("MATCH (c:Company)-[r:STARTS]->(m:Mission)-[l:LAUNCHES]->(rocket:Rocket) " +
                        "WHERE c.name IN ['NASA', 'SpaceX'] " +
                        "RETURN c.name, toInteger(split(l.date, '-')[0]) as year, count(l) as launches " +
                        "ORDER BY c.name, year");
result.list().forEach(record -> System.out.println(record.values().get(0) + " - " + record.values().get(1) + " - " + record.values().get(2)));

// 9. Pairs of companies that launched the same rocket
System.out.println("\n9. Pairs of companies that launched the same rocket: ");
result = session.run("MATCH (c1:Company)-[r1:STARTS]->(m:Mission)-[l:LAUNCHES]->(rocket:Rocket)<-[l2:LAUNCHES]-(m2:Mission)<-[r2:STARTS]-(c2:Company) " +
                        "WHERE id(c1) < id(c2) " +
                        "RETURN c1.name, c2.name, rocket.name");
result.list().stream().limit(5).forEach(record -> System.out.println(record.values().get(0) + " - " + record.values().get(1) + " - " + record.values().get(2)));
System.out.println("...");

// 10. Failed missions by location (order by number of failed missions)
System.out.println("\n10. Failed missions by location: ");
result = session.run("MATCH (m:Mission {status: \"Failure\"})-[l:LAUNCHES]->() " +
                        "RETURN l.location, count(l) as failedMissions " +
                        "ORDER BY failedMissions DESC");
result.list().stream().limit(5).forEach(record -> System.out.println(record.values().get(0) + " - " + record.values().get(1)));
System.out.println("...");
```

## Results

```plaintext
1. Companies that have launched a mission: 
"ILS"
"EER"
"AEB"
"SRC"
"KCST"
...

2. Rockets more than 50 launches: 
"Ariane 5 ECA"
"Falcon 9 Block 5"
"Voskhod"
"Vostok-2M"
"Cosmos-2I (63SM)"
...

3. Rocket more expensive: 
"Ares 1-X" - 450.0
"Space Shuttle Columbia" - 450.0
"Space Shuttle Challenger" - 450.0
"Space Shuttle Discovery" - 450.0
"Space Shuttle Atlantis" - 450.0
...

4. Number of launches per company: 
"RVSN USSR" - 1777
"CASC" - 343
"Arianespace" - 293
"General Dynamics" - 251
"VKS RF" - 221
...

5. Company with more missions failed: 
"RVSN USSR" - 117
"General Dynamics" - 37
"US Air Force" - 30
"US Navy" - 14
"CASC" - 14
...

6. Most common location for launches: 
"Site 31/6, Baikonur Cosmodrome, Kazakhstan" - 251
"Site 132/1, Plesetsk Cosmodrome, Russia" - 216
"Site 43/4, Plesetsk Cosmodrome, Russia" - 211
"Site 41/1, Plesetsk Cosmodrome, Russia" - 198
"Site 1/5, Baikonur Cosmodrome, Kazakhstan" - 193
...

7. Distance between US Air Force and NASA: 
4

8. Number of missions launched by year in SpaceX vs NASA: 
"NASA" - 1958 - 2
"NASA" - 1959 - 1
"NASA" - 1960 - 4
"NASA" - 1961 - 12
"NASA" - 1962 - 5
"NASA" - 1963 - 2
"NASA" - 1964 - 4
"NASA" - 1965 - 9
"NASA" - 1966 - 8
"NASA" - 1967 - 2
"NASA" - 1968 - 4
"NASA" - 1969 - 4
"NASA" - 1970 - 1
"NASA" - 1971 - 2
"NASA" - 1972 - 2
"NASA" - 1973 - 4
"NASA" - 1975 - 1
"NASA" - 1981 - 2
"NASA" - 1982 - 3
"NASA" - 1983 - 4
"NASA" - 1984 - 5
"NASA" - 1985 - 9
"NASA" - 1986 - 2
"NASA" - 1988 - 2
"NASA" - 1989 - 5
"NASA" - 1990 - 6
"NASA" - 1991 - 6
"NASA" - 1992 - 8
"NASA" - 1993 - 7
"NASA" - 1994 - 7
"NASA" - 1995 - 7
"NASA" - 1996 - 7
"NASA" - 1997 - 8
"NASA" - 1998 - 5
"NASA" - 1999 - 3
"NASA" - 2000 - 5
"NASA" - 2001 - 6
"NASA" - 2002 - 5
"NASA" - 2003 - 1
"NASA" - 2005 - 1
"NASA" - 2006 - 3
"NASA" - 2007 - 3
"NASA" - 2008 - 4
"NASA" - 2009 - 6
"NASA" - 2010 - 3
"NASA" - 2011 - 3
"SpaceX" - 2005 - 1
"SpaceX" - 2006 - 1
"SpaceX" - 2007 - 1
"SpaceX" - 2008 - 2
"SpaceX" - 2009 - 1
"SpaceX" - 2010 - 2
"SpaceX" - 2012 - 2
"SpaceX" - 2013 - 3
"SpaceX" - 2014 - 6
"SpaceX" - 2015 - 7
"SpaceX" - 2016 - 9
"SpaceX" - 2017 - 18
"SpaceX" - 2018 - 21
"SpaceX" - 2019 - 13
"SpaceX" - 2020 - 28
"SpaceX" - 2021 - 35
"SpaceX" - 2022 - 33

9. Pairs of companies that launched the same rocket: 
"ILS" - "ULA" - "Atlas V 401"
"ILS" - "ULA" - "Atlas V 401"
"ILS" - "ULA" - "Atlas V 401"
"ILS" - "ULA" - "Atlas V 431"
"ILS" - "ULA" - "Atlas V 401"
...

10. Failed missions by location: 
"Site 1/5, Baikonur Cosmodrome, Kazakhstan" - 32
"Imam Khomeini Spaceport, Semnan Space Center, Iran" - 9
"SLC-1W (75-3-4), Vandenberg AFB, California, USA" - 9
"Site 132/1, Plesetsk Cosmodrome, Russia" - 8
"Site 133/3, Plesetsk Cosmodrome, Russia" - 8
...
```